perftest/gin_jwt/gin_jwt_post.txt
[ POST /channel 200][1]

Summary:
  Total:	60.0283 secs
  Slowest:	0.3980 secs
  Fastest:	0.0032 secs
  Average:	0.0342 secs
  Requests/sec:	1460.9775
  
  Total data:	1841700 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.043 [69200]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.082 [11794]	|■■■■■■■
  0.122 [3644]	|■■
  0.161 [1655]	|■
  0.201 [827]	|
  0.240 [361]	|
  0.280 [148]	|
  0.319 [43]	|
  0.359 [18]	|
  0.398 [9]	|


Latency distribution:
  10% in 0.0107 secs
  25% in 0.0150 secs
  50% in 0.0234 secs
  75% in 0.0384 secs
  90% in 0.0688 secs
  95% in 0.1038 secs
  99% in 0.1828 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.3980 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0341 secs, 0.0031 secs, 0.3980 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [201]	87700 responses



[ POST /channel 200][2]

Summary:
  Total:	60.0357 secs
  Slowest:	0.5356 secs
  Fastest:	0.0030 secs
  Average:	0.0361 secs
  Requests/sec:	1384.9588
  
  Total data:	1746087 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.056 [70803]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.110 [8261]	|■■■■■
  0.163 [2648]	|■
  0.216 [893]	|■
  0.269 [361]	|
  0.323 [104]	|
  0.376 [53]	|
  0.429 [12]	|
  0.482 [9]	|
  0.536 [2]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0158 secs
  50% in 0.0246 secs
  75% in 0.0405 secs
  90% in 0.0733 secs
  95% in 0.1087 secs
  99% in 0.1917 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.5356 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0360 secs, 0.0030 secs, 0.5355 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0083 secs

Status code distribution:
  [201]	83147 responses



[ POST /channel 200][3]

Summary:
  Total:	60.0343 secs
  Slowest:	0.4956 secs
  Fastest:	0.0035 secs
  Average:	0.0358 secs
  Requests/sec:	1397.4013
  
  Total data:	1761732 bytes
  Size/request:	21 bytes

Response time histogram:
  0.004 [1]	|
  0.053 [70267]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.102 [8871]	|■■■■■
  0.151 [2964]	|■■
  0.200 [1116]	|■
  0.250 [453]	|
  0.299 [148]	|
  0.348 [46]	|
  0.397 [21]	|
  0.446 [3]	|
  0.496 [2]	|


Latency distribution:
  10% in 0.0112 secs
  25% in 0.0157 secs
  50% in 0.0244 secs
  75% in 0.0399 secs
  90% in 0.0725 secs
  95% in 0.1089 secs
  99% in 0.1904 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0035 secs, 0.4956 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0357 secs, 0.0034 secs, 0.4955 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [201]	83892 responses



[ POST /channel 200][4]

Summary:
  Total:	60.0344 secs
  Slowest:	0.5839 secs
  Fastest:	0.0030 secs
  Average:	0.0347 secs
  Requests/sec:	1438.5582
  
  Total data:	1813623 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.061 [75596]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.119 [7449]	|■■■■
  0.177 [2279]	|■
  0.235 [749]	|
  0.293 [223]	|
  0.352 [48]	|
  0.410 [12]	|
  0.468 [4]	|
  0.526 [1]	|
  0.584 [1]	|


Latency distribution:
  10% in 0.0107 secs
  25% in 0.0151 secs
  50% in 0.0234 secs
  75% in 0.0388 secs
  90% in 0.0708 secs
  95% in 0.1064 secs
  99% in 0.1866 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.5839 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0346 secs, 0.0030 secs, 0.5838 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0078 secs

Status code distribution:
  [201]	86363 responses



[ POST /channel 200][5]

Summary:
  Total:	60.0239 secs
  Slowest:	0.5827 secs
  Fastest:	0.0031 secs
  Average:	0.0351 secs
  Requests/sec:	1423.1508
  
  Total data:	1793883 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.061 [74680]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.119 [7374]	|■■■■
  0.177 [2363]	|■
  0.235 [720]	|
  0.293 [199]	|
  0.351 [63]	|
  0.409 [16]	|
  0.467 [4]	|
  0.525 [2]	|
  0.583 [1]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0154 secs
  50% in 0.0240 secs
  75% in 0.0393 secs
  90% in 0.0704 secs
  95% in 0.1067 secs
  99% in 0.1856 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0031 secs, 0.5827 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0051 secs
  resp wait:	0.0350 secs, 0.0030 secs, 0.5826 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0107 secs

Status code distribution:
  [201]	85423 responses



[ POST /channel 400][1]

Summary:
  Total:	60.0355 secs
  Slowest:	0.4724 secs
  Fastest:	0.0032 secs
  Average:	0.0365 secs
  Requests/sec:	1369.1722
  
  Total data:	1726179 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.050 [67257]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.097 [9715]	|■■■■■■
  0.144 [3081]	|■■
  0.191 [1345]	|■
  0.238 [466]	|
  0.285 [209]	|
  0.332 [73]	|
  0.379 [33]	|
  0.426 [11]	|
  0.472 [8]	|


Latency distribution:
  10% in 0.0114 secs
  25% in 0.0161 secs
  50% in 0.0251 secs
  75% in 0.0411 secs
  90% in 0.0734 secs
  95% in 0.1102 secs
  99% in 0.1894 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.4724 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0039 secs
  resp wait:	0.0364 secs, 0.0031 secs, 0.4723 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0080 secs

Status code distribution:
  [201]	82199 responses



[ POST /channel 400][2]

Summary:
  Total:	60.0344 secs
  Slowest:	0.5008 secs
  Fastest:	0.0036 secs
  Average:	0.0346 secs
  Requests/sec:	1442.3560
  
  Total data:	1818411 bytes
  Size/request:	21 bytes

Response time histogram:
  0.004 [1]	|
  0.053 [73330]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.103 [8956]	|■■■■■
  0.153 [2713]	|■
  0.202 [1073]	|■
  0.252 [340]	|
  0.302 [114]	|
  0.352 [39]	|
  0.401 [13]	|
  0.451 [5]	|
  0.501 [7]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0153 secs
  50% in 0.0237 secs
  75% in 0.0391 secs
  90% in 0.0701 secs
  95% in 0.1027 secs
  99% in 0.1801 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0036 secs, 0.5008 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0059 secs
  resp wait:	0.0345 secs, 0.0034 secs, 0.5008 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0080 secs

Status code distribution:
  [201]	86591 responses



[ POST /channel 400][3]

Summary:
  Total:	60.0299 secs
  Slowest:	0.4578 secs
  Fastest:	0.0030 secs
  Average:	0.0351 secs
  Requests/sec:	1422.0071
  
  Total data:	1792623 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.049 [69803]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.094 [10109]	|■■■■■■
  0.139 [3380]	|■■
  0.185 [1273]	|■
  0.230 [477]	|
  0.276 [204]	|
  0.321 [69]	|
  0.367 [32]	|
  0.412 [9]	|
  0.458 [6]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0155 secs
  50% in 0.0242 secs
  75% in 0.0396 secs
  90% in 0.0717 secs
  95% in 0.1056 secs
  99% in 0.1809 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.4578 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0060 secs
  resp wait:	0.0351 secs, 0.0030 secs, 0.4578 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0098 secs

Status code distribution:
  [201]	85363 responses



[ POST /channel 400][4]

Summary:
  Total:	60.0418 secs
  Slowest:	0.5438 secs
  Fastest:	0.0035 secs
  Average:	0.0355 secs
  Requests/sec:	1405.9042
  
  Total data:	1772673 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.058 [72416]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.112 [8095]	|■■■■
  0.166 [2581]	|■
  0.220 [944]	|■
  0.274 [275]	|
  0.328 [68]	|
  0.382 [25]	|
  0.436 [7]	|
  0.490 [0]	|
  0.544 [1]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0157 secs
  50% in 0.0243 secs
  75% in 0.0399 secs
  90% in 0.0726 secs
  95% in 0.1074 secs
  99% in 0.1850 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0035 secs, 0.5438 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0354 secs, 0.0034 secs, 0.5438 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [201]	84413 responses



[ POST /channel 400][5]

Summary:
  Total:	60.0382 secs
  Slowest:	0.4427 secs
  Fastest:	0.0032 secs
  Average:	0.0344 secs
  Requests/sec:	1453.8573
  
  Total data:	1833027 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.047 [71590]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.091 [9865]	|■■■■■■
  0.135 [3436]	|■■
  0.179 [1437]	|■
  0.223 [603]	|
  0.267 [247]	|
  0.311 [64]	|
  0.355 [35]	|
  0.399 [5]	|
  0.443 [4]	|


Latency distribution:
  10% in 0.0106 secs
  25% in 0.0150 secs
  50% in 0.0232 secs
  75% in 0.0383 secs
  90% in 0.0699 secs
  95% in 0.1068 secs
  99% in 0.1829 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.4427 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0343 secs, 0.0031 secs, 0.4426 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0077 secs

Status code distribution:
  [201]	87287 responses



[ POST /channel 600][1]

Summary:
  Total:	60.0356 secs
  Slowest:	0.5058 secs
  Fastest:	0.0030 secs
  Average:	0.0343 secs
  Requests/sec:	1458.0357
  
  Total data:	1838214 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.053 [74499]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.104 [8602]	|■■■■■
  0.154 [2771]	|■
  0.204 [1113]	|■
  0.254 [355]	|
  0.305 [135]	|
  0.355 [45]	|
  0.405 [8]	|
  0.455 [4]	|
  0.506 [1]	|


Latency distribution:
  10% in 0.0106 secs
  25% in 0.0150 secs
  50% in 0.0232 secs
  75% in 0.0384 secs
  90% in 0.0689 secs
  95% in 0.1041 secs
  99% in 0.1840 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.5058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0045 secs
  resp wait:	0.0342 secs, 0.0029 secs, 0.5057 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [201]	87534 responses



[ POST /channel 600][2]

Summary:
  Total:	60.0285 secs
  Slowest:	0.4500 secs
  Fastest:	0.0026 secs
  Average:	0.0349 secs
  Requests/sec:	1432.8028
  
  Total data:	1806189 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.047 [70117]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.092 [10210]	|■■■■■■
  0.137 [3386]	|■■
  0.182 [1511]	|■
  0.226 [517]	|
  0.271 [162]	|
  0.316 [66]	|
  0.361 [21]	|
  0.405 [13]	|
  0.450 [5]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0155 secs
  50% in 0.0239 secs
  75% in 0.0392 secs
  90% in 0.0710 secs
  95% in 0.1063 secs
  99% in 0.1784 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0026 secs, 0.4500 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0061 secs
  resp wait:	0.0348 secs, 0.0025 secs, 0.4499 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0094 secs

Status code distribution:
  [201]	86009 responses



[ POST /channel 600][3]

Summary:
  Total:	60.0287 secs
  Slowest:	0.5397 secs
  Fastest:	0.0031 secs
  Average:	0.0343 secs
  Requests/sec:	1456.0046
  
  Total data:	1835442 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.057 [75629]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.110 [7833]	|■■■■
  0.164 [2582]	|■
  0.218 [942]	|
  0.271 [294]	|
  0.325 [97]	|
  0.379 [16]	|
  0.432 [4]	|
  0.486 [3]	|
  0.540 [1]	|


Latency distribution:
  10% in 0.0107 secs
  25% in 0.0151 secs
  50% in 0.0233 secs
  75% in 0.0382 secs
  90% in 0.0690 secs
  95% in 0.1047 secs
  99% in 0.1859 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0031 secs, 0.5397 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0342 secs, 0.0030 secs, 0.5396 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0047 secs

Status code distribution:
  [201]	87402 responses



[ POST /channel 600][4]

Summary:
  Total:	60.0299 secs
  Slowest:	0.4099 secs
  Fastest:	0.0034 secs
  Average:	0.0344 secs
  Requests/sec:	1453.0929
  
  Total data:	1831809 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.044 [69584]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.085 [11118]	|■■■■■■
  0.125 [3637]	|■■
  0.166 [1634]	|■
  0.207 [701]	|
  0.247 [357]	|
  0.288 [138]	|
  0.329 [31]	|
  0.369 [23]	|
  0.410 [5]	|


Latency distribution:
  10% in 0.0107 secs
  25% in 0.0150 secs
  50% in 0.0233 secs
  75% in 0.0385 secs
  90% in 0.0699 secs
  95% in 0.1047 secs
  99% in 0.1829 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0034 secs, 0.4099 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0343 secs, 0.0033 secs, 0.4099 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [201]	87229 responses



[ POST /channel 600][5]

Summary:
  Total:	60.0329 secs
  Slowest:	0.4511 secs
  Fastest:	0.0033 secs
  Average:	0.0360 secs
  Requests/sec:	1386.8059
  
  Total data:	1748334 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.048 [67505]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.093 [10124]	|■■■■■■
  0.138 [3218]	|■■
  0.182 [1443]	|■
  0.227 [571]	|
  0.272 [247]	|
  0.317 [92]	|
  0.362 [42]	|
  0.406 [10]	|
  0.451 [1]	|


Latency distribution:
  10% in 0.0112 secs
  25% in 0.0159 secs
  50% in 0.0247 secs
  75% in 0.0404 secs
  90% in 0.0725 secs
  95% in 0.1086 secs
  99% in 0.1901 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0033 secs, 0.4511 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0037 secs
  resp wait:	0.0359 secs, 0.0032 secs, 0.4510 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [201]	83254 responses



[ POST /channel 800][1]

Summary:
  Total:	60.0346 secs
  Slowest:	0.4009 secs
  Fastest:	0.0030 secs
  Average:	0.0336 secs
  Requests/sec:	1485.4279
  
  Total data:	1872717 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.043 [71149]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.083 [11259]	|■■■■■■
  0.122 [3695]	|■■
  0.162 [1778]	|■
  0.202 [758]	|
  0.242 [325]	|
  0.282 [162]	|
  0.321 [38]	|
  0.361 [8]	|
  0.401 [4]	|


Latency distribution:
  10% in 0.0105 secs
  25% in 0.0147 secs
  50% in 0.0228 secs
  75% in 0.0373 secs
  90% in 0.0688 secs
  95% in 0.1039 secs
  99% in 0.1803 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.4009 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0051 secs
  resp wait:	0.0335 secs, 0.0029 secs, 0.4004 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [201]	89177 responses



[ POST /channel 800][2]

Summary:
  Total:	60.0373 secs
  Slowest:	0.6187 secs
  Fastest:	0.0036 secs
  Average:	0.0355 secs
  Requests/sec:	1407.9580
  
  Total data:	1775130 bytes
  Size/request:	21 bytes

Response time histogram:
  0.004 [1]	|
  0.065 [74612]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.127 [7108]	|■■■■
  0.188 [2079]	|■
  0.250 [549]	|
  0.311 [142]	|
  0.373 [30]	|
  0.434 [7]	|
  0.496 [0]	|
  0.557 [1]	|
  0.619 [1]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0157 secs
  50% in 0.0243 secs
  75% in 0.0402 secs
  90% in 0.0722 secs
  95% in 0.1061 secs
  99% in 0.1811 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0036 secs, 0.6187 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0354 secs, 0.0035 secs, 0.6185 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0083 secs

Status code distribution:
  [201]	84530 responses



[ POST /channel 800][3]

Summary:
  Total:	60.0296 secs
  Slowest:	0.4688 secs
  Fastest:	0.0035 secs
  Average:	0.0353 secs
  Requests/sec:	1417.3181
  
  Total data:	1786701 bytes
  Size/request:	21 bytes

Response time histogram:
  0.004 [1]	|
  0.050 [70571]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.097 [9387]	|■■■■■
  0.143 [2995]	|■■
  0.190 [1272]	|■
  0.236 [490]	|
  0.283 [231]	|
  0.329 [84]	|
  0.376 [31]	|
  0.422 [14]	|
  0.469 [5]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0156 secs
  50% in 0.0240 secs
  75% in 0.0392 secs
  90% in 0.0711 secs
  95% in 0.1063 secs
  99% in 0.1897 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0035 secs, 0.4688 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0352 secs, 0.0034 secs, 0.4687 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0087 secs

Status code distribution:
  [201]	85081 responses



[ POST /channel 800][4]

Summary:
  Total:	60.0248 secs
  Slowest:	0.4400 secs
  Fastest:	0.0031 secs
  Average:	0.0336 secs
  Requests/sec:	1485.3706
  
  Total data:	1872339 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.047 [73250]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.090 [10290]	|■■■■■■
  0.134 [3379]	|■■
  0.178 [1407]	|■
  0.222 [526]	|
  0.265 [200]	|
  0.309 [77]	|
  0.353 [18]	|
  0.396 [5]	|
  0.440 [6]	|


Latency distribution:
  10% in 0.0105 secs
  25% in 0.0148 secs
  50% in 0.0230 secs
  75% in 0.0377 secs
  90% in 0.0686 secs
  95% in 0.1021 secs
  99% in 0.1745 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0031 secs, 0.4400 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0084 secs
  resp wait:	0.0336 secs, 0.0031 secs, 0.4399 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0090 secs

Status code distribution:
  [201]	89159 responses



[ POST /channel 800][5]

Summary:
  Total:	60.0331 secs
  Slowest:	0.7702 secs
  Fastest:	0.0030 secs
  Average:	0.0358 secs
  Requests/sec:	1396.2805
  
  Total data:	1760283 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.080 [76521]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.156 [5644]	|■■■
  0.233 [1361]	|■
  0.310 [230]	|
  0.387 [49]	|
  0.463 [12]	|
  0.540 [3]	|
  0.617 [1]	|
  0.693 [0]	|
  0.770 [1]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0157 secs
  50% in 0.0244 secs
  75% in 0.0400 secs
  90% in 0.0727 secs
  95% in 0.1093 secs
  99% in 0.1888 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.7702 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0055 secs
  resp wait:	0.0357 secs, 0.0029 secs, 0.7701 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0055 secs

Status code distribution:
  [201]	83823 responses



[ POST /channel 1000][1]

Summary:
  Total:	60.0336 secs
  Slowest:	0.4819 secs
  Fastest:	0.0036 secs
  Average:	0.0353 secs
  Requests/sec:	1417.1221
  
  Total data:	1786575 bytes
  Size/request:	21 bytes

Response time histogram:
  0.004 [1]	|
  0.051 [71129]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.099 [8999]	|■■■■■
  0.147 [2976]	|■■
  0.195 [1202]	|■
  0.243 [457]	|
  0.291 [204]	|
  0.338 [69]	|
  0.386 [21]	|
  0.434 [13]	|
  0.482 [4]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0154 secs
  50% in 0.0239 secs
  75% in 0.0393 secs
  90% in 0.0710 secs
  95% in 0.1069 secs
  99% in 0.1899 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0036 secs, 0.4819 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0352 secs, 0.0036 secs, 0.4818 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0058 secs

Status code distribution:
  [201]	85075 responses



[ POST /channel 1000][2]

Summary:
  Total:	60.0317 secs
  Slowest:	0.4948 secs
  Fastest:	0.0030 secs
  Average:	0.0337 secs
  Requests/sec:	1484.4825
  
  Total data:	1871436 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.052 [75686]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.101 [8944]	|■■■■■
  0.151 [2908]	|■■
  0.200 [1072]	|■
  0.249 [372]	|
  0.298 [99]	|
  0.347 [26]	|
  0.396 [6]	|
  0.446 [1]	|
  0.495 [1]	|


Latency distribution:
  10% in 0.0106 secs
  25% in 0.0149 secs
  50% in 0.0231 secs
  75% in 0.0379 secs
  90% in 0.0680 secs
  95% in 0.1017 secs
  99% in 0.1750 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.4948 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0064 secs
  resp wait:	0.0336 secs, 0.0029 secs, 0.4948 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0051 secs

Status code distribution:
  [201]	89116 responses



[ POST /channel 1000][3]

Summary:
  Total:	60.0293 secs
  Slowest:	0.4501 secs
  Fastest:	0.0029 secs
  Average:	0.0340 secs
  Requests/sec:	1467.8842
  
  Total data:	1850436 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.048 [72433]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.092 [10374]	|■■■■■■
  0.137 [3188]	|■■
  0.182 [1308]	|■
  0.227 [511]	|
  0.271 [204]	|
  0.316 [67]	|
  0.361 [20]	|
  0.405 [8]	|
  0.450 [2]	|


Latency distribution:
  10% in 0.0107 secs
  25% in 0.0151 secs
  50% in 0.0234 secs
  75% in 0.0385 secs
  90% in 0.0684 secs
  95% in 0.1014 secs
  99% in 0.1783 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0029 secs, 0.4501 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0340 secs, 0.0029 secs, 0.4500 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0055 secs

Status code distribution:
  [201]	88116 responses



[ POST /channel 1000][4]

Summary:
  Total:	60.0334 secs
  Slowest:	0.5030 secs
  Fastest:	0.0031 secs
  Average:	0.0364 secs
  Requests/sec:	1373.2183
  
  Total data:	1731219 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.053 [68698]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.103 [9110]	|■■■■■
  0.153 [2989]	|■■
  0.203 [1052]	|■
  0.253 [374]	|
  0.303 [150]	|
  0.353 [43]	|
  0.403 [13]	|
  0.453 [8]	|
  0.503 [1]	|


Latency distribution:
  10% in 0.0114 secs
  25% in 0.0162 secs
  50% in 0.0250 secs
  75% in 0.0411 secs
  90% in 0.0738 secs
  95% in 0.1088 secs
  99% in 0.1864 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0031 secs, 0.5030 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0363 secs, 0.0030 secs, 0.5029 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0056 secs

Status code distribution:
  [201]	82439 responses



[ POST /channel 1000][5]

Summary:
  Total:	60.0316 secs
  Slowest:	0.5471 secs
  Fastest:	0.0033 secs
  Average:	0.0353 secs
  Requests/sec:	1413.7554
  
  Total data:	1782270 bytes
  Size/request:	21 bytes

Response time histogram:
  0.003 [1]	|
  0.058 [73146]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.112 [7934]	|■■■■
  0.166 [2503]	|■
  0.221 [854]	|
  0.275 [286]	|
  0.330 [102]	|
  0.384 [27]	|
  0.438 [15]	|
  0.493 [1]	|
  0.547 [1]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0156 secs
  50% in 0.0242 secs
  75% in 0.0397 secs
  90% in 0.0711 secs
  95% in 0.1057 secs
  99% in 0.1873 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0033 secs, 0.5471 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0036 secs
  resp wait:	0.0353 secs, 0.0032 secs, 0.5470 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0051 secs

Status code distribution:
  [201]	84870 responses